---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures
source: html/575d7542-9a7a-e3c9-7f11-0cc040d74aac.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures

Failures about WallJoin.

## Syntax (C#)
```csharp
public static class WallJoinFailures
```